org/notes/floss.org
#+TITLE: 自由軟體與開放源碼
#+OPTIONS: H:2
#+HTML_LINK_HOME: ../index.html
#+HTML_LINK_UP: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />

* 如何成為 Debian Deveoper 
** 10分鐘快速簡介
- 影片: [[http://www.youtube.com/watch?v=9ClVlUXi0ZU&feature=player_embedded][成為DD你也行]]
- 大綱
  - 什麼是 Debian Developer
  - 成為 Debian Developer 的好處
  - 成為 Debian Developer 需要很強的技術能力嗎
  - 成為 Debian Developer 有什麼義務
  - Canonical 目前有幾位 Debian Developer
** 上半部
- 影片: [[http://www.archive.org/download/Road2DD/SANY7730-computer_512kb.mp4][Road2DD-1]]
- 大綱
  - 什麼是Debian Developer
  - 成為Debian Developer的好處
  - 申請前需有的資格
  - 申請流程
  - PP1: 價值觀
    - 解釋 Debian 社群契約
    - 是否是自由軟體的三個測試
    - 沙漠荒島: 是否宣稱修改過的source一定要送回upstream
    - 秘密反抗軍: 是否宣稱修改過的source一定要公開, 即使別人沒拿到 Binary
      - 邪惡的觸角:使否有撤銷條款
      - 什麼是Source
** 下半部
- 影片: [[http://www.archive.org/download/Road2DD2/SANY7741_512kb.mp4][Road2DD-2]]
- 大綱:
  - Debian 與 Ubuntu 的關係
    - 套件同步流程
    - patch 什麼時候送 Upstream, 什麼時候送 Debian, 甚時候送 Ubuntu
    - 什麼樣的套件 Ubuntu 沒辦法送回 Debian
  - PP2 Procedure
    - Debian 的 Bug Tracker
    - NMU - 非維護者上傳
    - Debian 的 投票機制
    - GPG 簽名機制
    - 新套件上傳方式
    - 翻譯的方式
  - TS1 - Tasks - 完成 3個任務
    - 修RC Bug
    - QA
    -  翻譯
  - TS2 - Skills - 檢驗技術能力
    - 申請之後
    -  DM 與 DD的差別
