blog/cs/floss.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-04 Mon 20:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>自由軟體與開放源碼</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">自由軟體與開放源碼</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">如何成為 Debian Deveoper</a>
<ul>
<li><a href="#orgheadline1">10分鐘快速簡介</a></li>
<li><a href="#orgheadline2">上半部</a></li>
<li><a href="#orgheadline3">下半部</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">如何成為 Debian Deveoper</h2>
<div class="outline-text-2" id="text-orgheadline4">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">10分鐘快速簡介</h3>
<div class="outline-text-3" id="text-orgheadline1">
<ul class="org-ul">
<li>影片: <a href="http://www.youtube.com/watch?v=9ClVlUXi0ZU&amp;feature=player_embedded">成為DD你也行</a></li>
<li>大綱
<ul class="org-ul">
<li>什麼是 Debian Developer</li>
<li>成為 Debian Developer 的好處</li>
<li>成為 Debian Developer 需要很強的技術能力嗎</li>
<li>成為 Debian Developer 有什麼義務</li>
<li>Canonical 目前有幾位 Debian Developer</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">上半部</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li>影片: <a href="http://www.archive.org/download/Road2DD/SANY7730-computer_512kb.mp4">Road2DD-1</a></li>
<li>大綱
<ul class="org-ul">
<li>什麼是Debian Developer</li>
<li>成為Debian Developer的好處</li>
<li>申請前需有的資格</li>
<li>申請流程</li>
<li>PP1: 價值觀
<ul class="org-ul">
<li>解釋 Debian 社群契約</li>
<li>是否是自由軟體的三個測試</li>
<li>沙漠荒島: 是否宣稱修改過的source一定要送回upstream</li>
<li>秘密反抗軍: 是否宣稱修改過的source一定要公開, 即使別人沒拿到 Binary
<ul class="org-ul">
<li>邪惡的觸角:使否有撤銷條款</li>
<li>什麼是Source</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">下半部</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>影片: <a href="http://www.archive.org/download/Road2DD2/SANY7741_512kb.mp4">Road2DD-2</a></li>
<li>大綱:
<ul class="org-ul">
<li>Debian 與 Ubuntu 的關係
<ul class="org-ul">
<li>套件同步流程</li>
<li>patch 什麼時候送 Upstream, 什麼時候送 Debian, 甚時候送 Ubuntu</li>
<li>什麼樣的套件 Ubuntu 沒辦法送回 Debian</li>
</ul></li>
<li>PP2 Procedure
<ul class="org-ul">
<li>Debian 的 Bug Tracker</li>
<li>NMU - 非維護者上傳</li>
<li>Debian 的 投票機制</li>
<li>GPG 簽名機制</li>
<li>新套件上傳方式</li>
<li>翻譯的方式</li>
</ul></li>
<li>TS1 - Tasks - 完成 3個任務
<ul class="org-ul">
<li>修RC Bug</li>
<li>QA</li>
<li>翻譯</li>
</ul></li>
<li>TS2 - Skills - 檢驗技術能力
<ul class="org-ul">
<li>申請之後</li>
<li>DM 與 DD的差別</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Hsin-Yi</p>
<p class="date">Created: 2016-04-04 Mon 20:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
